Repository: hejmsdz/sagrada
Catalog: lib/l10n/app_*.arb
Languages: pl

source: Select public objectives
pl: Wybierz cele grupowe

source: Light shades
pl: Jasne odcienie

source: Medium shades
pl: Pośrednie odcienie

source: Deep shades
pl: Ciemne odcienie

source: Color variety
pl: Różnorodność kolorów

source: Shade variety
pl: Różnorodność odcieni

source: Column color variety
pl: Różnorodność kolorów w kolumnie

source: Column shade variety
pl: Różnorodność odcieni w kolumnie

source: Row color variety
pl: Różnorodność kolorów w rzędzie

source: Row shade variety
pl: Różnorodność odcieni w rzędzie

source: Color diagonals
pl: Kolorowe przekątne

# objectivesSelectionMessage
source: Select 3 objectives to continue.
pl: Zaznacz 3 cele, aby kontynuować.

source: Scan your window frame
pl: Zeskanuj ramkę witrażu

source: Camera access required
pl: Wymagany dostęp do aparatu

# cameraAccessRequiredMessage
source: In order to scan the dice on your board, the app requires access to your device's camera. Please grant camera permissions to proceed.
pl: Aby zeskanować kostki na Twojej planszy, aplikacja potrzebuje dostępu do aparatu. Zezwól na dostęp, aby kontynuować.

source: Retry
pl: Spróbuj jeszcze raz

# photoFramingTip
source: Frame your photo, so that the individual dice fit in the spaces between grid lines.
pl: Wykadruj zdjęcie tak, żeby kostki znajdowały się w polach siatki widocznej na ekranie.

source: Board scanning results
pl: Wyniki skanowania

# lowConfidenceMessage
source: For better scanning results, hold the phone steadily straight over the board, make sure that the light is uniform and that the dice lie exactly between the grid lines.
pl: Żeby wyniki skanowania były lepsze, trzymaj telefon stabilnie prosto nad planszą, postaraj się, żeby kostki były jednolicie oświetlone i żeby znajdowały się dokładnie między liniami siatki.

source: Confirm
pl: Potwierdź

# tapToCorrect
source: or tap a misidentified dice to correct it.
pl: lub dotknij źle rozpoznaną kostkę, aby ją poprawić.

# shareCorrections
source: Share your corrections?
pl: Zgoda na przesyłanie poprawek

# shareCorrectionsMessage
source: You can help to improve the scanning accuracy, if you agree to anonymously share misidentified fragments your board photo and your manual corrections with the developer. No personal information is disclosed.
pl: Jeśli chcesz pomóc ulepszyć jakość skanowania, możesz anonimowo przesłać do twórcy aplikacji źle rozpoznane fragmenty Twojego zdjęcia planszy i ręczne poprawki. Żadne osobiste informacje nie zostaną udostępnione.

source: Allow
pl: Zgadzam się

source: Deny
pl: Nie zgadzam się

source: Placement rules check
pl: Sprawdzenie zasad

# placementRulesCheckTip
source: Some dice are placed incorrectly and have to be removed from the board. Tap a dice to remove it. (Note: if this is a scanning mistake, go back and correct it.)
pl: Niektóre kostki są ustawione niezgodnie z zasadami i muszą zostać usunięte z planszy. Dotknij wybraną kostkę, aby ją usunąć. (Uwaga: jeśli to błąd skanowania, wróć do poprzedniego kroku i go popraw).

# placementRulesSatisfied
source: Well done! All dice placement rules are now satisfied.
pl: Dobrze! Teraz wszystkie zasady są już spełnione.

source: Scoring
pl: Punkty

source: Select private objective
pl: Wybierz cel indywidualny

# privateObjective
source: Private objective ({color})
pl: Cel indywidualny ({color})

# blankPenalty
source: Penalty for blank spaces
pl: Kara za puste pola

source: Favor tokens left
pl: Znaczniki uznania

source: Total
pl: Razem

source: blue
pl: niebieski

source: green
pl: zielony

source: purple
pl: fioletowy

source: red
pl: czerwony

source: yellow
pl: żółty

source: Check another board
pl: Sprawdź kolejną planszę

source: Leaderboard
pl: Tablica wyników

source: Whose score was that?
pl: Czyj to wynik?

# enterPlayerName
source: Enter the name of the player whose scoring we've just calculated in order to include it in a leaderboard.
pl: Wpisz imię gracza, którego planszę właśnie sprawdziliśmy, żeby umieścić go na tablicy wyników.

source: Player name
pl: Imię gracza

source: New game
pl: Nowa gra
